## Устанавливаем необходимые библиотеки SQL для работы в JN

Устанавливаем MySQL https://dev.mysql.com/downloads/installer/

Устанавливаем необходимые библиотеки:

In [1]:
# !pip install pymysql  # не надо
# !pip install ipython-sql
# !pip install mysqlclient
# !pip install mysql-connector-python  # не надо
# !pip install sqlalchemy

Устанавливаем соединениес MySQL:

In [2]:
import sqlalchemy

In [3]:
sqlalchemy.create_engine("mysql://root:123qwe@localhost/mydb")

Engine(mysql://root:***@localhost/mydb)

In [4]:
%load_ext sql

In [5]:
%sql mysql://root:123qwe@localhost/mydb

In [6]:
%%sql
DROP SCHEMA IF EXISTS stepik;
CREATE SCHEMA IF NOT EXISTS stepik;

 * mysql://root:***@localhost/mydb
0 rows affected.
1 rows affected.

[]

### Актуализируем таблицу для урока 1.3:

In [11]:
%%sql
UPDATE book SET amount = 3 WHERE book_id = 4;

INSERT INTO book(title, author, price, amount)
VALUES ('Игрок', 'Достоевский Ф.М.', 480.50, 10);

 * mysql://root:***@localhost/mydb
1 rows affected.
1 rows affected.

[]

In [12]:
%%sql
SELECT * FROM book

 * mysql://root:***@localhost/mydb
6 rows affected.

[(1, 'Мастер и Маргарита', 'Булгаков М.А.', Decimal('670.99'), 3),
 (2, 'Белая гвардия', 'Булгаков М.А.', Decimal('540.50'), 5),
 (3, 'Идиот', 'Достоевский Ф.М.', Decimal('460.00'), 10),
 (4, 'Братья Карамазовы', 'Достоевский Ф.М.', Decimal('799.01'), 3),
 (5, 'Стихотворения и поэмы', 'Есенин С.А.', Decimal('650.00'), 15),
 (6, 'Игрок', 'Достоевский Ф.М.', Decimal('480.50'), 10)]

## 1.3.2 Выбор уникальных элементов столбца

Отобрать различные (уникальные) элементы столбца **amount** таблицы **book**.

In [13]:
%%sql
SELECT DISTINCT amount
FROM book;

 * mysql://root:***@localhost/mydb
4 rows affected.

[(3,), (5,), (10,), (15,)]

## 1.3.3 Выборка данных, групповые функции SUM и COUNT

Посчитать, количество различных книг и количество экземпляров книг каждого автора , хранящихся на складе.  Столбцы назвать **Автор**, **Различных_книг** и **Количество_экземпляров** соответственно.

In [14]:
%%sql
SELECT
    author AS Автор,
    COUNT(title) AS Различных_книг,
    SUM(amount) AS Количество_экземпляров
FROM
    book
GROUP BY
    author;

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Булгаков М.А.', 2, Decimal('8')),
 ('Достоевский Ф.М.', 3, Decimal('23')),
 ('Есенин С.А.', 1, Decimal('15'))]

## 1.3.4 Выборка данных, групповые функции MIN, MAX и AVG

Вывести фамилию и инициалы автора, минимальную, максимальную и среднюю цену книг каждого автора . Вычисляемые столбцы назвать **Минимальная_цена**, **Максимальная_цена** и **Средняя_цена соответственно**.

In [15]:
%%sql
SELECT
    author,
    MIN(price) AS Минимальная_цена,
    MAX(price) AS Максимальная_цена,
    AVG(price) AS Средняя_цена
FROM
    book
GROUP BY
    author

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Булгаков М.А.', Decimal('540.50'), Decimal('670.99'), Decimal('605.745000')),
 ('Достоевский Ф.М.', Decimal('460.00'), Decimal('799.01'), Decimal('579.836667')),
 ('Есенин С.А.', Decimal('650.00'), Decimal('650.00'), Decimal('650.000000'))]

## 1.3.5 Выборка данных c вычислением, групповые функции

Для каждого автора вычислить суммарную стоимость книг S (имя столбца **Стоимость**), а также вычислить налог на добавленную стоимость  для полученных сумм (имя столбца **НДС** ) , который включен в стоимость и составляет k = 18%,  а также стоимость книг (**Стоимость_без_НДС**) без него. Значения округлить до двух знаков после запятой.

In [16]:
%%sql
SELECT
    author,
    SUM(price * amount) AS Стоимость,
    ROUND(SUM(price * amount) * 0.18 / 1.18, 2) AS НДС,
    ROUND(SUM(price * amount) / 1.18, 2) AS Стоимость_без_НДС
FROM
    book
GROUP BY
    author

 * mysql://root:***@localhost/mydb
3 rows affected.

[('Булгаков М.А.', Decimal('4715.47'), Decimal('719.31'), Decimal('3996.16')),
 ('Достоевский Ф.М.', Decimal('11802.03'), Decimal('1800.31'), Decimal('10001.72')),
 ('Есенин С.А.', Decimal('9750.00'), Decimal('1487.29'), Decimal('8262.71'))]

## 1.3.6 Вычисления по таблице целиком

Вывести  цену самой дешевой книги, цену самой дорогой и среднюю цену уникальных книг на складе. Названия столбцов **Минимальная_цена**, **Максимальная_цена**, **Средняя_цена** соответственно. Среднюю цену округлить до двух знаков после запятой.

In [18]:
%%sql
SELECT
    ROUND(MIN(price), 2) AS Минимальная_цена,
    ROUND(MAX(price), 2) AS Максимальная_цена,
    ROUND(AVG(price), 2) AS Средняя_цена
FROM
    book

 * mysql://root:***@localhost/mydb
1 rows affected.

[(Decimal('460.00'), Decimal('799.01'), Decimal('600.17'))]

## 1.3.7 Выборка данных по условию, групповые функции

Вычислить среднюю цену и суммарную стоимость тех книг, количество экземпляров которых принадлежит интервалу от 5 до 14, включительно. Столбцы назвать **Средняя_цена** и **Стоимость**, значения округлить до 2-х знаков после запятой.  
**Пояснение.** Если в запросе с групповыми функциями отсутствует GROUP BY, то для отбора записей используется ключевое слово WHERE.

In [20]:
%%sql
SELECT
    ROUND(AVG(price), 2) AS Средняя_цена,
    ROUND(SUM(price * amount), 2) AS Стоимость
FROM
    book
WHERE
    amount BETWEEN 5 AND 14;

 * mysql://root:***@localhost/mydb
1 rows affected.

[(Decimal('493.67'), Decimal('12107.50'))]

## 1.3.8 Выборка данных по условию, групповые функции, WHERE и HAVING

Посчитать стоимость всех экземпляров каждого автора без учета книг «Идиот» и «Белая гвардия». В результат включить только тех авторов, у которых суммарная стоимость книг (без учета книг «Идиот» и «Белая гвардия») более 5000 руб. Вычисляемый столбец назвать Стоимость. Результат отсортировать по убыванию стоимости.

In [21]:
%%sql
SELECT
    author,
    SUM(price * amount) AS Стоимость
FROM
    book
WHERE
    title NOT IN('Идиот', 'Белая гвардия')
GROUP BY
    author
HAVING
    Стоимость > 5000
ORDER BY
    Стоимость DESC;

 * mysql://root:***@localhost/mydb
2 rows affected.

[('Есенин С.А.', Decimal('9750.00')), ('Достоевский Ф.М.', Decimal('7202.03'))]